Development flow
================

Цей документ є пропозицією для потоку, який ми використовували на протязі одного спрінта з використанням gitorious. Цей процес потребує покращень, тому якщо у вас є такі то здорово б було їх вносити

Структура репозиторіїв
======================

Репозиторії організовуються в три рівні:

* стабільний репозиторій
* репозиторії тім-лідів
* репозиторії розробників

Стабільний репозиторій
----------------------

Стабільний репозиторій (він же головний репозиторій) — це репозиторій, який містить стабільний код. В ньому зазвичай буде два бранча:

* master — бранч з стабільний релізом
* develop — бранч, який містить код наступного релізу

Надалі стабільний репозиторій позначатиметься *stable*. Для резілу в живу систему _завжди_ братиметься код з бранча *master*.

Репозиторій тім-ліда
--------------------

Репозиторій тім-ліда містить в собі код, над яким працює команда. Всі члени команди оновлюють свій код з цього репозиторію і відправляють мердж реквести в цей репозиторій. В свою чергу тім-лід являється відповідальним за те, щоб локальні гілки *master* і *develop* були оновлені з stable. Базово, цей репозиторій є основною «кастролею», де варяться нові фічі.

Репозиторій розробника
----------------------

Репозиторій розробника — це репозиторій, в якому кінцевий девелопер тримає код, над яким він вже завершив роботу. В такий момент він відправляє мердж реквест на репозиторій тім-ліда, після перегляду, тім-лід мерджить цей код в свій репозиторій (зазвичай в окремий бранч).
